In [1]:
import pandas as pd

# Open df

In [4]:
FILE_PATH = 'ecommerce.csv'

In [146]:
ecommerce = pd.read_csv(FILE_PATH, encoding='latin1',sep=";")

In [147]:
#use shape for structure
ecommerce.shape

(541909, 8)

In [9]:
#use head to for first five rows
ecommerce.head(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

# Format a little

In [148]:
#compute total
ecommerce['total'] = ecommerce['Quantity']*ecommerce['UnitPrice']

# Define a fake df, an extract is fine but if you need to use all the dataframe, it's ok for me.

In [149]:
#for example the first 50 will be
fake_ecommerce = ecommerce

In [150]:
fake_ecommerce

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,total
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France,10.20
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France,12.60
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France,16.60
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France,16.60
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France,14.85

# Define customer target for your extracted fake_df

In [17]:
customer_target = pd.DataFrame({
    'customerID':  [],
    'total': [],
    'number_items': [],
    'number_invoices': [],
    'first_invoice_date':[],
    'mean_buy':[]
})

In [14]:
customer_target

Empty DataFrame
Columns: [customerID, total, number_items, number_invoices, first_invoice_date]
Index: []

# Define invoices target for your extracted fake_df

In [15]:
invoices_target = pd.DataFrame({
    'invoiceID': [],
    'date':[] ,
    'CustomerID': [],
    'total': [],
    'number_items': [],
})

In [16]:
invoices_target

Empty DataFrame
Columns: [invoiceID, date, CustomerID, total, number_items]
Index: []

# Steps : groupby

- unique to have index (customerID, invoiceID in each table)
- dataframe.key.value counts for the number of items (number of rows) per key
- dataframe.groupby(key)[value].operation

Note : take care of order (some operations are sorted, other not). Make sure to always sort

# Implementation, by CustomerID

## Customer ID

In [22]:
# sort fake_ecommerce Customer ID
fake_ecommerce= fake_ecommerce.sort_values("CustomerID")

## Number of items

In [42]:
customer_id = fake_ecommerce["CustomerID"]

In [44]:
customer_id

61619     12346.0
61624     12346.0
286628    12347.0
72263     12347.0
72264     12347.0
           ...
541536        NaN
541537        NaN
541538        NaN
541539        NaN
541540        NaN
Name: CustomerID, Length: 541909, dtype: float64

In [163]:
#use value.counts and sort_index to return number of items of fake_ecommerce
number_items=fake_ecommerce.groupby('CustomerID')['Quantity'].sum().sort_index()
number_items

CustomerID
12346.0       0
12347.0    2458
12348.0    2341
12349.0     631
12350.0     197
           ...
18280.0      45
18281.0      54
18282.0      98
18283.0    1397
18287.0    1586
Name: Quantity, Length: 4372, dtype: int64

## Total

In [30]:
#Try this and define total
total = fake_ecommerce.groupby('CustomerID')['total'].sum().sort_index()

In [31]:
total

CustomerID
12346.0       0.00
12347.0    4310.00
12348.0    1797.24
12349.0    1757.55
12350.0     334.40
            ...
18280.0     180.60
18281.0      80.82
18282.0     176.60
18283.0    2094.88
18287.0    1837.28
Name: total, Length: 4372, dtype: float64

## Number of invoice

In [34]:
number_invoices = fake_ecommerce.groupby('CustomerID')['InvoiceDate'].count().sort_index()

In [35]:
number_invoices

CustomerID
12346.0      2
12347.0    182
12348.0     31
12349.0     73
12350.0     17
          ...
18280.0     10
18281.0      7
18282.0     13
18283.0    756
18287.0     70
Name: InvoiceDate, Length: 4372, dtype: int64

## First invoice

In [37]:

first_invoice_date = fake_ecommerce.groupby('CustomerID')['InvoiceDate'].min().sort_index()

In [38]:
#use pd.to_datetime and dt.date
first_invoice_date = pd.to_datetime(first_invoice_date).dt.date
first_invoice_date

CustomerID
12346.0    2011-01-18
12347.0    2011-01-26
12348.0    2011-01-25
12349.0    2011-11-21
12350.0    2011-02-02
              ...
18280.0    2011-03-07
18281.0    2011-06-12
18282.0    2011-12-02
18283.0    2011-01-23
18287.0    2011-10-12
Name: InvoiceDate, Length: 4372, dtype: object

In [164]:
mean_buy=fake_ecommerce.groupby('CustomerID')['total'].mean().sort_index()
customer_computed = pd.DataFrame({
    'total':total,
    'number_items': number_items,
    'number_invoices':number_invoices ,
    'first_invoice_date': first_invoice_date,
    'mean_buy':mean_buy
})

In [165]:

customer_computed.reset_index(inplace=True)

In [166]:
customer_computed

,index,total,number_items,number_invoices,first_invoice_date,mean_buy
0,12346.0,NaN,0.0,2.0,2011-01-18,0.000000
1,12347.0,NaN,2458.0,182.0,2011-01-26,23.681319
2,12348.0,NaN,2341.0,31.0,2011-01-25,57.975484
3,12349.0,NaN,631.0,73.0,2011-11-21,24.076027
4,12350.0,NaN,197.0,17.0,2011-02-02,19.670588
...,...,...,...,...,...,...
30267,C581484,-168469.60,NaN,NaN,NaN,NaN
30268,C581490,-23.40,NaN,NaN,NaN,NaN
30269,C581499,-224.69,NaN,NaN,NaN,NaN
30270,C581568,-54.75,NaN,NaN,NaN,NaN
30271,C581569,-1.25,NaN,NaN,NaN,NaN

In [95]:
pd.to_datetime(customer_computed['first_invoice_date'], errors='coerce').dt.date
customer_computed['first_invoice_date']= customer_computed['first_invoice_date'].astype("datetime64[ns]")
#customer_computed=pd.to_datetime(c'first_invoice_date')
#dataframe['date'] = pd.to_datetime(dataframe['date'], errors='coerce')

Test it

In [126]:
customer_computed.head()

,CustomerID,total,number_items,number_invoices,first_invoice_date,mean_buy
0,12346.0,0.00,2,2,2011-01-18,0.000000
1,12347.0,4310.00,182,182,2011-01-26,23.681319
2,12348.0,1797.24,31,31,2011-01-25,57.975484
3,12349.0,1757.55,73,73,2011-11-21,24.076027
4,12350.0,334.40,17,17,2011-02-02,19.670588

In [127]:
customer_target

Empty DataFrame
Columns: [customerID, total, number_items, number_invoices, first_invoice_date, mean_buy]
Index: []

# Implementation, by InvoiceNo

## Invoice

In [153]:
invoiceID = fake_ecommerce['InvoiceNo']
invoiceID

0         536365
1         536365
2         536365
3         536365
4         536365
           ...
541904    581587
541905    581587
541906    581587
541907    581587
541908    581587
Name: InvoiceNo, Length: 541909, dtype: object

## Custommer

In [154]:
CustomerID = fake_ecommerce.groupby('InvoiceNo')['CustomerID'].agg(['unique'])
CustomerID.rename(columns={"unique": "CustomerID"})
CustomerID = CustomerID.squeeze()

In [155]:
CustomerID.head(2)

InvoiceNo
536365    [17850.0]
536366    [17850.0]
Name: unique, dtype: object

In [180]:
CustomerID = CustomerID.apply(lambda x: x[0])

In [84]:
CustomerID.head(2)

InvoiceNo
536365    17850.0
536366    17850.0
Name: CustomerID, dtype: float64

In [156]:
fake_ecommerce.head(4)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,total
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34

# date

In [159]:
date = fake_ecommerce.groupby('InvoiceNo')['InvoiceDate'].agg(['unique'])
date.rename(columns={"unique": "date"})
date = date.squeeze()
date = date.apply(lambda x: x[0])
date.head(2)

InvoiceNo
536365    12/1/2010 8:26
536366    12/1/2010 8:28
Name: unique, dtype: object

# total

In [167]:
total = fake_ecommerce.groupby('InvoiceNo')['total'].sum().sort_index()
total.head(2)

InvoiceNo
536365    139.12
536366     22.20
Name: total, dtype: float64

# number of items

In [183]:
number_items = fake_ecommerce.groupby('InvoiceNo')['Quantity'].count().sort_index()
number_items.head(2)

InvoiceNo
536365    7
536366    2
Name: Quantity, dtype: int64

# Aggregate all

In [184]:
computed_invoices = pd.DataFrame({
    'date': date,
    'CustomerID': CustomerID,
    'total':total ,
    'number_items': number_items
})
computed_invoices.reset_index(inplace=True)

In [185]:
computed_invoices

      InvoiceNo             date  CustomerID      total  number_items
0        536365   12/1/2010 8:26     17850.0     139.12             7
1        536366   12/1/2010 8:28     17850.0      22.20             2
2        536367   12/1/2010 8:34     13047.0     278.73            12
3        536368   12/1/2010 8:34     13047.0      70.05             4
4        536369   12/1/2010 8:35     13047.0      17.85             1
...         ...              ...         ...        ...           ...
25895   C581484   12/9/2011 9:27     16446.0 -168469.60             1
25896   C581490   12/9/2011 9:57     14397.0     -32.53             2
25897   C581499  12/9/2011 10:28     15498.0    -224.69             1
25898   C581568  12/9/2011 11:57     15311.0     -54.75             1
25899   C581569  12/9/2011 11:58     17315.0      -7.50             2

[25900 rows x 5 columns]

In [90]:
computed_invoices

  invoiceID            date  CustomerID   total  number_items
0    536365  12/1/2010 8:26     17850.0  139.12             7
1    536366  12/1/2010 8:28     17850.0   22.20             2
2    536367  12/1/2010 8:34     13047.0  278.73            12
3    536368  12/1/2010 8:34     13047.0   70.05             4
4    536369  12/1/2010 8:35     13047.0   17.85             1
5    536370  12/1/2010 8:45     12583.0  855.86            20
6    536371  12/1/2010 9:00     13748.0  204.00             1
7    536372  12/1/2010 9:01     17850.0   22.20             2
8    536373  12/1/2010 9:02     17850.0   15.30             1

In [91]:
invoices_target

  invoiceID       date  CustomerID   total  number_items
0    536365 2010-12-01       17850  139.12             7
1    536366 2010-12-01       17850   22.20             2
2    536367 2010-12-01       13047  278.73            12
3    536368 2010-12-01       13047   70.05             4
4    536369 2010-12-01       13047   17.85             1
5    536370 2010-12-01       12583  855.86            20
6    536371 2010-12-01       13748  204.00             1
7    536372 2010-12-01       17850   22.20             2
8    536373 2010-12-01       17850   15.30             1

# In a python file

In [95]:
from ecommerce import framer

In [96]:
framer.frame_consumer()

         customerID   total  number_items  number_invoices first_invoice_date
12583.0     12583.0  855.86            20                1     12/1/2010 8:45
13047.0     13047.0  366.63            17                3     12/1/2010 8:34
13748.0     13748.0  204.00             1                1     12/1/2010 9:00
17850.0     17850.0  198.82            12                4     12/1/2010 8:26

In [119]:
framer.frame_invoices()

       invoiceID            date  CustomerID   total  number_items
536365    536365  12/1/2010 8:26     17850.0  139.12             7
536366    536366  12/1/2010 8:28     17850.0   22.20             2
536367    536367  12/1/2010 8:34     13047.0  278.73            12
536368    536368  12/1/2010 8:34     13047.0   70.05             4
536369    536369  12/1/2010 8:35     13047.0   17.85             1
536370    536370  12/1/2010 8:45     12583.0  855.86            20
536371    536371  12/1/2010 9:00     13748.0  204.00             1
536372    536372  12/1/2010 9:01     17850.0   22.20             2
536373    536373  12/1/2010 9:02     17850.0   15.30             1